//* SOLID — це набір з п'яти принципів об'єктно-орієнтованого програмування, 
//* які допомагають створювати чистий, масштабований і підтримуваний код. 

//* - Кожен клас або модуль повинен мати лише одну причину для змін.
//* - Класи повинні бути відкриті для розширення, але закриті для модифікації.
//* - Похідні класи повинні повністю замінювати базові класи без змін у логіці.
//* - Краще багато дрібних інтерфейсів, ніж один великий.
//* - Високорівневі модулі не повинні залежати від низькорівневих. 
//*   Вони повинні залежати від абстракцій.




//*   ________     1. Single Responsibility Principle (SRP)
