// import {amountInWords} from "./task1"

// const { log } = require('console');
// const { describe } = require('yargs');
// const amountInWords = require('./task1');
// const wordProv = require('./task1');
// const wordSplit = require('./task1');
// const numSplit = require('./task1');

// describe('amountInWords', () => {
//   test('конвертирует 0 в слова', () => {
//     expect(amountInWords(0)).toBe('нуль гривень нуль копійок');
//   });
//   test('конвертирует целое число', () => {
//     expect(amountInWords(123)).toBe('сто двадцять три гривні нуль копійок');
//   });

//   test('конвертирует число с копейками', () => {
//     expect(amountInWords(45.67)).toBe('сорок пʼять гривень шістдесят сім копійок');
//   });

//   test('конвертирует большое число', () => {
//     expect(amountInWords(1235573.31)).toBe('один мільйон двісті тридцять пʼять тисяч пʼятсот сімдесят три гривні тридцять одна копійка');
//   });

//   test('конвертирует отрицательное число', () => {
//     expect(amountInWords(-250)).toBe('мінус двісті пʼятдесят гривень нуль копійок');
//   });
// });

// describe('Условие на разделение слов', () => {
//     test('1', () => {
//         expect(wordProv("1", 'тисяча|тисячі|тисяч')).toBe('одна тисяча');
//       });
//       test('2', () => {
//         expect(wordProv("2", 'тисяча|тисячі|тисяч')).toBe('дві тисячі');
//       });
//       test('3', () => {
//         expect(wordProv("3", 'тисяча|тисячі|тисяч')).toBe('три тисячі');
//       });
//       test('0', () => {
//         expect(wordProv("0", 'тисяча|тисячі|тисяч')).toBe('нуль тисяч');
//       });
//       test('4', () => {
//         expect(wordProv("4", 'тисяча|тисячі|тисяч')).toBe('чотири тисячі');
//       });
// })

// describe('РОБОТА НАД ЧИСЛОВИМИ ГРУПАМИ', () => {
//     test('3 цифри', () => {
//         expect(wordSplit("123", 'тисяча|тисячі|тисяч')).toBe('сто двадцять три тисячі');
//       });
//     test('2 цифри', () => {
//         expect(wordSplit("012", 'тисяча|тисячі|тисяч')).toBe('дванадцять тисяч');
//       });
//     test('1 цифра', () => {
//         expect(wordSplit("002", 'тисяча|тисячі|тисяч')).toBe('дві тисячі');
//       });
// })

// describe('ФУНКЦІЯ СКЛЕЙКИ СЛІВ', () => {
//   test('копійки', () => {
//     expect(numSplit('67', 'копійка|копійки|копійок')).toBe('шістдесят сім копійок');
//   });
//   test('мала', () => {
//     expect(numSplit('1,012', 'гривня|гривні|гривень')).toBe('одна тисяча дванадцять гривень');
//   });
//   test('велика', () => {
//     expect(numSplit('12,135,762,447,001', 'гривня|гривні|гривень')).toBe('дванадцять трильйонів сто тридцять пʼять мільярдів сімсот шістдесят два мільйони чотириста сорок сім тисяч одна гривня');
//   });
// });
